Revit 2027 API
RebarBendingDetail.GetRotation Method
 Gets the rotation angle in radians for the bending detail relative to its view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double GetRotation(
	Element bendingDetail
)
Public Shared Function GetRotation (
	bendingDetail As Element
) As Double
public:
static double GetRotation(
	Element^ bendingDetail
)
static member GetRotation :
        bendingDetail : Element -> float
Parameters
bendingDetail Element
 The bending detail for which we want to get the rotation.
Return Value
Double
 Returns the rotation angle in radians for the bending detail relative to its view.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace